Функция СведенияОВнешнейОбработке() Экспорт
	
	МодульДополнительныеОтчетыИОбработки = ОбщийМодуль("ДополнительныеОтчетыИОбработки");
	МодульДополнительныеОтчетыИОбработкиКлиентСервер = ОбщийМодуль("ДополнительныеОтчетыИОбработкиКлиентСервер");
	
	Если ТипЗнч(МодульДополнительныеОтчетыИОбработки) <> Тип("ОбщийМодуль") 
		ИЛИ ТипЗнч(МодульДополнительныеОтчетыИОбработкиКлиентСервер) <> Тип("ОбщийМодуль") Тогда
	
		Возврат Неопределено;
	
	КонецЕсли;
	
    ПараметрыРегистрации = МодульДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
    
    // Вид обработки: ДополнительнаяОбработка, ПечатнаяФорма, ЗаполнениеОбъекта и др.
    ПараметрыРегистрации.Вид = МодульДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
    
    ПараметрыРегистрации.Наименование = "Пятнашки";
    ПараметрыРегистрации.Версия = "1.0";
    ПараметрыРегистрации.БезопасныйРежим = Истина; 
    ПараметрыРегистрации.Информация = "Игра антистресс от 1С ""Пятнашки"".
	|Пятнашки - обычная стандартная игра ""Пятнашки"".
	|	
	|Полезная обработка снятия стресса и расслабления.
	|";
    
    // Добавление команды
    НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = "1С&Антистресс: Пятнашки";
    НоваяКоманда.Идентификатор = "1С_Антистресс_Пятнашки";
    
    // Тип команды: ОткрытиеФормы, ВызовСерверногоМетода или ВызовКлиентскогоМетода
    НоваяКоманда.Использование = МодульДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
    НоваяКоманда.ПоказыватьОповещение = Ложь;
    
    Возврат ПараметрыРегистрации;
    
КонецФункции  

Функция ОбщийМодуль(Имя)
	
	Попытка

		Если Метаданные.ОбщиеМодули.Найти(Имя) <> Неопределено Тогда
			Модуль = Вычислить(Имя);
		Иначе
			Модуль = Неопределено;
		КонецЕсли;
		
	Исключение
		
		Модуль = Неопределено;
		
	КонецПопытки;
	
	Возврат Модуль;
	
КонецФункции
